# Pandas Case Study-4

# Pandas Exercise: Grouping (OCCUPATION FILE)

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user).

In [2]:
url='https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user'
df=pd.read_csv(url,sep='|')
df.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

### Step 3. Assign it to a variable called users.

In [3]:
users=df
users.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

### Step 4. Discover what is the mean age per occupation

In [4]:
users.dtypes

user_id        int64
age            int64
gender        object
occupation    object
zip_code      object
dtype: object

In [5]:
users[['occupation','age']].groupby(['occupation']).mean().head()

                     age
occupation
administrator  38.746835
artist         31.392857
doctor         43.571429
educator       42.010526
engineer       36.388060

### Step 5. Discover the Male ratio per occupation and sort it from the most to the least

In [9]:
df1=users.loc[(users['gender']=='M')& (users['occupation'])]
df1.head()

   user_id  age gender     occupation zip_code
0        1   24      M     technician    85711
2        3   23      M         writer    32067
3        4   24      M     technician    43537
5        6   42      M      executive    98101
6        7   57      M  administrator    91344

In [15]:
df1[['gender','occupation']].groupby(['occupation']).agg(['max'])

              gender
                 max
occupation
administrator      M
artist             M
doctor             M
educator           M
engineer           M
entertainment      M
executive          M
healthcare         M
homemaker          M
lawyer             M
librarian          M
marketing          M
none               M
other              M
programmer         M
retired            M
salesman           M
scientist          M
student            M
technician         M
writer             M

### Step 6. For each occupation, calculate the minimum and maximum ages

In [9]:
users[['occupation','age']].groupby(['occupation']).agg(['min','max']).add_suffix('_age').head()

              age_age
              min_age max_age
occupation
administrator      21      70
artist             19      48
doctor             28      64
educator           23      63
engineer           22      70

### Step 7. For each combination of occupation and gender, calculate the mean age

In [10]:
users[['occupation','gender','age']].groupby(['occupation','gender']).mean().head()

                            age
occupation    gender
administrator F       40.638889
              M       37.162791
artist        F       30.307692
              M       32.333333
doctor        M       43.571429

### Step 8.  For each occupation present the percentage of women and men

In [13]:
df2=users.loc[(users['gender']=='F') & users['occupation']]
df2.head()

    user_id  age gender occupation zip_code
1         2   53      F      other    94043
4         5   33      F      other    15213
10       11   39      F      other    30329
11       12   28      F      other    06405
14       15   49      F   educator    97301

In [14]:
df1.head()

   user_id  age gender     occupation zip_code
0        1   24      M     technician    85711
2        3   23      M         writer    32067
3        4   24      M     technician    43537
5        6   42      M      executive    98101
6        7   57      M  administrator    91344

In [16]:
df2[['gender','occupation']].groupby(['occupation']).agg(['max'])

              gender
                 max
occupation
administrator      F
artist             F
educator           F
engineer           F
entertainment      F
executive          F
healthcare         F
homemaker          F
lawyer             F
librarian          F
marketing          F
none               F
other              F
programmer         F
retired            F
salesman           F
scientist          F
student            F
technician         F
writer             F